#1 Получить коэффициент калибровки давления - 1 балл
#2 Получить коэффициент калибровки расстояния - 1 балл
#3 Построить график калибровки давления - 1 балл
#4 Построить график калибровки расстояния - 1 балл

#5 Пересчитать давления в скорости по уравнению Бернулли - 1 балл



#6 Построить общий график скоростей - 1 балл

#7 "Центрировать" графики скоростей (поместить максимум каждого графика в 0 мм относительно центра сопла) - 1 балл
#   i Центрировать "глазами и руками", добавляя в скрипт обработки значения поправок
#   ii Приветствуется автоматическая центровка при помощи скрипта (необязательно, +1 балл)

#8 Рассчитать расход в каждом из сечений - 1 балл

#9 Нанести расходы на график скоростей - 1 балл

#10 Построить график зависимости расхода от расстояния до сопла - 1 балл
